%{
% Скрипт демонструє побудову двогорбової гаусівської функції належності типу gauss2mf.
% Мета прикладу – показати, як поєднання двох гаусівських компонент моделює складні нечіткі множини.
% Послідовність: сформувати універсум дискурсу, обчислити значення gauss2mf та відобразити результат на графіку.
%}
x = (0:0.2:10); % Створення рівномірного вектора значень універсуму дискурсу від 0 до 10 з кроком 0.2
y = gauss2mf(x, [1 5 1.5 6]); plot(x, y); % Обчислення двокомпонентної гаусівської функції з параметрами [σ1 c1 σ2 c2] та побудова графіка
grid % Вмикання сітки для зручності аналізу форми функції належності
ylabel('y') % Пояснення осі ординат, що показує величину належності
xlabel('x') % Підпис осі абсцис, яка представляє універсум дискурсу