%{
% Скрипт демонструє комбіновану сигмоїдальну функцію dsigmf, що створює “вікно” належності.
% Мета – показати, як вибір параметрів двох сигмоїд формує область високої належності між центрами.
% Кроки: сформувати універсум дискурсу, обчислити dsigmf із заданими параметрами та побудувати графік.
%}
x = (0:0.2:10); % Формує вектор значень універсуму дискурсу від 0 до 10 з кроком 0.2
y = dsigmf(x,[5 2 5 7]); % Обчислює комбіновану сигмоїдальну функцію з параметрами [a1 c1 a2 c2]
plot(x,y); % Будує графік отриманої функції належності
grid; % Вмикає сітку для полегшення аналізу форми кривої
ylabel('y'); % Підписує вісь ординат як значення ступеня належності
xlabel('x') % Пояснює вісь абсцис як універсум дискурсу
