%{
% Скрипт порівнює кілька правосторонніх сигмоїдальних функцій належності, що зменшуються до нуля.
% Мета – показати вплив від’ємної крутизни на зсув та форму спадної сигмоїди.
% Покроково: формування універсуму дискурсу, обчислення трьох сигмоїд із різними параметрами та їх візуальне порівняння.
%}
x = (0:0.2:10); % Формує вектор значень універсуму дискурсу від 0 до 10 з кроком 0.2
y1 = sigmf(x, [-6 7]); % Обчислює спадну сигмоїду з крутизною -6 та центром 7
y2 = sigmf(x, [-4 5]); % Обчислює спадну сигмоїду з крутизною -4 та центром 5
y3 = sigmf(x, [-1 5]); % Обчислює спадну сигмоїду з меншою крутизною -1 і центром 5
plot(x,y1,x,y2,x,y3) % Будує три спадні сигмоїди на одному графіку для порівняння
grid; % Вмикає сітку для полегшення аналізу кривих
ylabel('y'); % Підписує вісь ординат як ступінь належності
xlabel('x') % Пояснює вісь абсцис як універсум дискурсу